[net]
batch=128
subdivisions=1
height=224
width=224
channels=3
momentum=0.9
decay=0.0005
max_crop=320

learning_rate=0.0005
policy=poly
power=4
max_batches=1600000

[convolutional]
filters=16
size=3
stride=1
pad=1
activation=relu

[convolutional]
filters=16
size=3
stride=2
pad=1
activation=relu

[convolutional]
filters=32
size=3
stride=2
pad=1
activation=relu

[convolutional]
filters=32
size=3
stride=2
pad=1
activation=relu

[convolutional]
filters=2
size=1
stride=1
pad=1
activation=leaky

[avgpool]

[softmax]
groups=1

[cost]
type=sse

